arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpi2c_hal.h
/*
 * Copyright (c) 2014 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef __FSL_LPI2C_HAL_H__
#define __FSL_LPI2C_HAL_H__

#include <stdbool.h>
#include "fsl_device_registers.h"

/*!
 * @addtogroup lpi2c_hal
 * @{
 */

/*!
 * @file
 *
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/


/*!
 * LPI2C master interrupts
 */

#define   LPI2C_HAL_MASTER_DATA_MATCH_INT           0x4000UL   /*!< Data Match Interrupt       */
#define   LPI2C_HAL_MASTER_PIN_LOW_TIMEOUT_INT      0x2000UL   /*!< Pin Low Timeout Interrupt  */
#define   LPI2C_HAL_MASTER_FIFO_ERROR_INT           0x1000UL   /*!< FIFO Error Interrupt       */
#define   LPI2C_HAL_MASTER_ARBITRATION_LOST_INT      0x800UL   /*!< Arbitration Lost Interrupt */
#define   LPI2C_HAL_MASTER_NACK_DETECT_INT           0x400UL   /*!< NACK Detect Interrupt      */
#define   LPI2C_HAL_MASTER_STOP_DETECT_INT           0x200UL   /*!< STOP Detect Interrupt      */
#define   LPI2C_HAL_MASTER_END_PACKET_INT            0x100UL   /*!< End Packet Interrupt       */
#define   LPI2C_HAL_MASTER_RECEIVE_DATA_INT            0x2UL   /*!< Receive Data Interrupt     */
#define   LPI2C_HAL_MASTER_TRANSMIT_DATA_INT           0x1UL   /*!< Transmit Data Interrupt    */
                                     
/*!
 * LPI2C slave interrupts
 */
#define   LPI2C_HAL_SLAVE_SMBUS_ALERT_RESPONSE_INT  0x8000UL   /*!< SMBus Alert Response Interrupt */
#define   LPI2C_HAL_SLAVE_GENERAL_CALL_INT          0x4000UL   /*!< General Call Interrupt         */
#define   LPI2C_HAL_SLAVE_ADDRESS_MATCH_1_INT       0x2000UL   /*!< Address Match 1 Interrupt      */
#define   LPI2C_HAL_SLAVE_ADDRESS_MATCH_0_INT       0x1000UL   /*!< Address Match 0 Interrupt      */
#define   LPI2C_HAL_SLAVE_FIFO_ERROR_INT             0x800UL   /*!< FIFO Error Interrupt           */
#define   LPI2C_HAL_SLAVE_BIT_ERROR_INT              0x400UL   /*!< Bit Error Interrupt            */
#define   LPI2C_HAL_SLAVE_STOP_DETECT_INT            0x200UL   /*!< STOP Detect Interrupt          */
#define   LPI2C_HAL_SLAVE_REPEATED_START_INT         0x100UL   /*!< Repeated Start Interrupt       */
#define   LPI2C_HAL_SLAVE_TRANSMIT_ACK_INT             0x8UL   /*!< Transmit ACK Interrupt         */
#define   LPI2C_HAL_SLAVE_ADDRESS_VALID_INT            0x4UL   /*!< Address Valid Interrupt        */
#define   LPI2C_HAL_SLAVE_RECEIVE_DATA_INT             0x2UL   /*!< Receive Data Interrupt         */
#define   LPI2C_HAL_SLAVE_TRANSMIT_DATA_INT            0x1UL   /*!< Transmit Data Interrupt        */

/*! @brief LPI2C module version number */
typedef struct
{
    uint8_t  majorNumber;       /**< Major Version Number */
    uint8_t  minorNumber;       /**< Minor Version Number */
    uint16_t featureNumber;     /**< Feature Specification Number */
} lpi2c_version_info_t;

/*! @brief Non_matching data discard options */
typedef enum lpi2c_rx_data_match {
    LPI2C_RX_DATA_KEEP_ALL           = 0U,   /*!< Received data is stored in the receive FIFO as normal */
    LPI2C_RX_DATA_DROP_NON_MATCHING  = 1U,   /*!< Received data is discarded unless the RMF is set */
} lpi2c_rx_data_match_t;

/*! @brief Host request input source selection */
typedef enum lpi2c_hreq_source {
    LPI2C_HREQ_EXTERNAL_PIN      = 0U,   /*!< Host request input is external pin */
    LPI2C_HREQ_INTERNAL_TRIGGER  = 1U,   /*!< Host request input is internal trigger */
} lpi2c_hreq_source_t;

/*! @brief Host request input polarity selection */
typedef enum lpi2c_hreq_polarity {
    LPI2C_HREQ_POL_ACTIVE_HIGH  = 0U,   /*!< Host request active low */
    LPI2C_HREQ_POL_ACTIVE_LOW   = 1U,   /*!< Host request active high */
} lpi2c_hreq_polarity_t;

/*! @brief Pin configuration selection */
typedef enum lpi2c_pin_config {
    LPI2C_CFG_2PIN_OPEN_DRAIN             = 0U,  /*!< 2-pin open drain mode */
    LPI2C_CFG_2PIN_OUTPUT_ONLY            = 1U,  /*!< 2-pin output only mode (ultra-fast mode) */
    LPI2C_CFG_2PIN_PUSH_PULL              = 2U,  /*!< 2-pin push-pull mode */
    LPI2C_CFG_4PIN_PUSH_PULL              = 3U,  /*!< 4-pin push-pull mode */
    LPI2C_CFG_2PIN_OPEN_DRAIN_SLAVE       = 4U,  /*!< 2-pin open drain mode with separate LPI2C slave */
    LPI2C_CFG_2PIN_OUTPUT_ONLY_SLAVE      = 5U,  /*!< 2-pin output only mode (ultra-fast mode) with separate LPI2C slave */
    LPI2C_CFG_2PIN_PUSH_PULL_SLAVE        = 6U,  /*!< 2-pin push-pull mode with separate LPI2C slave */
    LPI2C_CFG_4PIN_PUSH_PULL_INVERTED     = 7U,  /*!< 4-pin push-pull mode (inverted outputs) */
} lpi2c_pin_config_t;

/*! @brief Data match selection */
typedef enum lpi2c_match_config {
    LPI2C_MATCH_DISABLED       = 0U,  /*!< Match disabled */
    LPI2C_MATCH_OR_FIRST       = 2U,  /*!< Match enabled (1st data word equals MATCH0 OR MATCH1) */
    LPI2C_MATCH_OR_ANY         = 3U,  /*!< Match enabled (any data word equals MATCH0 OR MATCH1) */
    LPI2C_MATCH_AND_FIRST      = 4U,  /*!< Match enabled (1st data word equals MATCH0 AND 2nd data word equals MATCH1) */
    LPI2C_MATCH_AND_ANY        = 5U,  /*!< Match enabled (any data word equals MATCH0 AND next data word equals MATCH1) */
    LPI2C_MATCH_MASK_FIRST     = 6U,  /*!< Match enabled (1st data word AND MATCH1 equals MATCH0 AND MATCH1) */
    LPI2C_MATCH_MASK_ANY       = 7U,  /*!< Match enabled (any data word AND MATCH1 equals MATCH0 AND MATCH1) */
} lpi2c_match_config_t;

/*! @brief SCL/SDA low time-out configuration */
typedef enum lpi2c_timeout_config {
    LPI2C_TIMEOUT_SCL          = 0U,  /*!< Pin Low Timeout Flag will set if SCL is low for longer than the configured timeout */
    LPI2C_TIMEOUT_SCL_OR_SDA   = 1U,  /*!< Pin Low Timeout Flag will set if either SCL or SDA is low for longer than the configured timeout */
} lpi2c_timeout_config_t;

