arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpi2c_hal.h
/*! @brief Master NACK reaction configuration */
typedef enum lpi2c_nack_config {
    LPI2C_NACK_RECEIVE    = 0U,  /*!< Receive ACK and NACK normally */
    LPI2C_NACK_IGNORE     = 1U,  /*!< Treat a received NACK as if it was an ACK */
} lpi2c_nack_config_t;

/*! @brief LPI2C master prescaler options */
typedef enum lpi2c_master_prescaler {
    LPI2C_MASTER_PRESC_DIV_1    = 0U,  /*!< Divide by 1   */
    LPI2C_MASTER_PRESC_DIV_2    = 1U,  /*!< Divide by 2   */
    LPI2C_MASTER_PRESC_DIV_4    = 2U,  /*!< Divide by 4   */
    LPI2C_MASTER_PRESC_DIV_8    = 3U,  /*!< Divide by 8   */
    LPI2C_MASTER_PRESC_DIV_16   = 4U,  /*!< Divide by 16  */
    LPI2C_MASTER_PRESC_DIV_32   = 5U,  /*!< Divide by 32  */
    LPI2C_MASTER_PRESC_DIV_64   = 6U,  /*!< Divide by 64  */
    LPI2C_MASTER_PRESC_DIV_128  = 7U,  /*!< Divide by 128 */
} lpi2c_master_prescaler_t;

/*! @brief LPI2C master commands */
typedef enum lpi2c_master_command {
    LPI2C_MASTER_COMMAND_TRANSMIT         = 0U,  /*!< Transmit DATA[7:0] */
    LPI2C_MASTER_COMMAND_RECEIVE          = 1U,  /*!< Receive (DATA[7:0] + 1) bytes */
    LPI2C_MASTER_COMMAND_STOP             = 2U,  /*!< Generate STOP condition */
    LPI2C_MASTER_COMMAND_RECEIVE_DISCARD  = 3U,  /*!< Receive and discard (DATA[7:0] + 1) bytes */
    LPI2C_MASTER_COMMAND_START            = 4U,  /*!< Generate START and transmit address in DATA[7:0] */
    LPI2C_MASTER_COMMAND_START_NACK       = 5U,  /*!< Generate START and transmit address in DATA[7:0], expect a NACK to be returned */
    LPI2C_MASTER_COMMAND_START_HS         = 6U,  /*!< Generate START and transmit address in DATA[7:0] in high speed mode */
    LPI2C_MASTER_COMMAND_START_NACK_HS    = 7U,  /*!< Generate START and transmit address in DATA[7:0] in high speed mode, expect a NACK to be returned */
} lpi2c_master_command_t;

/*! @brief Slave address configuration */
typedef enum lpi2c_slave_addr_config {
    LPI2C_SLAVE_ADDR_MATCH_0_7BIT              = 0U,  /*!< Address match 0 (7-bit) */
    LPI2C_SLAVE_ADDR_MATCH_0_10BIT             = 1U,  /*!< Address match 0 (10-bit) */
    LPI2C_SLAVE_ADDR_MATCH_0_7BIT_OR_1_7BIT    = 2U,  /*!< Address match 0 (7-bit) or Address match 1 (7-bit) */
    LPI2C_SLAVE_ADDR_MATCH_0_10BIT_OR_1_10BIT  = 3U,  /*!< Address match 0 (10-bit) or Address match 1 (10-bit) */
    LPI2C_SLAVE_ADDR_MATCH_0_7BIT_OR_1_10BIT   = 4U,  /*!< Address match 0 (7-bit) or Address match 1 (10-bit) */
    LPI2C_SLAVE_ADDR_MATCH_0_10BIT_OR_1_7BIT   = 5U,  /*!< Address match 0 (10-bit) or Address match 1 (7-bit) */
    LPI2C_SLAVE_ADDR_MATCH_RANGE_7BIT          = 6U,  /*!< From Address match 0 (7-bit) to Address match 1 (7-bit) */
    LPI2C_SLAVE_ADDR_MATCH_RANGE_10BIT         = 7U,  /*!< From Address match 0 (10-bit) to Address match 1 (10-bit) */
} lpi2c_slave_addr_config_t;

/*! @brief Slave NACK reaction configuration */
typedef enum lpi2c_slave_nack_config {
    LPI2C_SLAVE_NACK_END_TRANSFER       = 0U,  /*!< Slave will end transfer when NACK detected */
    LPI2C_SLAVE_NACK_CONTINUE_TRANSFER  = 1U,  /*!< Slave will not end transfer when NACK detected */
} lpi2c_slave_nack_config_t;

/*! @brief Slave receive data register function configuration */
typedef enum lpi2c_slave_rxdata_config {
    LPI2C_SLAVE_RXDATA_DATA_ONLY     = 0U,  /*!< Reading the receive data register will return only data */
    LPI2C_SLAVE_RXDATA_DATA_OR_ADDR  = 1U,  /*!< Reading the receive data register can return data or address */
} lpi2c_slave_rxdata_config_t;

/*! @brief Slave Transmit Data Flag function control */
typedef enum lpi2c_slave_txflag_config {
    LPI2C_SLAVE_TXFLAG_TRANSFER_ONLY  = 0U,  /*!< only assert during a slave-transmit transfer */
    LPI2C_SLAVE_TXFLAG_ALWAYS         = 1U,  /*!< assert whenever the transmit data register is empty */
} lpi2c_slave_txflag_config_t;

/*! @brief Slave received address validity */
typedef enum lpi2c_slave_addr_valid {
    LPI2C_SLAVE_ADDR_VALID      = 0U,  /*!< RADDR is valid */
    LPI2C_SLAVE_ADDR_NOT_VALID  = 1U,  /*!< RADDR is not valid */
} lpi2c_slave_addr_valid_t;

/*! @brief Slave ACK transmission options */
typedef enum lpi2c_slave_nack_transmit {
    LPI2C_SLAVE_TRANSMIT_ACK   = 0U,  /*!< Transmit ACK for received word  */
    LPI2C_SLAVE_TRANSMIT_NACK  = 1U,  /*!< Transmit NACK for received word */
} lpi2c_slave_nack_transmit_t;


/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Configuration
 * @{
 */

/*!
 * @brief Get the version of the LPI2C module
 * 
 * This function reads the version number of the LPI2C hardware module
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param versionInfo  Device Version Number
 */
static inline void  LPI2C_HAL_GetVersion(LPI2C_Type *baseAddr, lpi2c_version_info_t *versionInfo)
{
    uint32_t tmp = baseAddr->VERID;
    versionInfo->majorNumber = (tmp & LPI2C_VERID_MAJOR_MASK) >> LPI2C_VERID_MAJOR_SHIFT;
    versionInfo->minorNumber = (tmp & LPI2C_VERID_MINOR_MASK) >> LPI2C_VERID_MINOR_SHIFT;
    versionInfo->featureNumber = (tmp & LPI2C_VERID_FEATURE_MASK) >> LPI2C_VERID_FEATURE_SHIFT;
    return;
}


/*!
 * @brief Get the size of the Master Receive FIFO
 * 
 * This function returns the size of the Master Receive FIFO, always a power of 2.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  Master Receive FIFO Size
 */
static inline uint16_t  LPI2C_HAL_GetMasterRxFIFOSize(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->PARAM;
    tmp = (tmp & LPI2C_PARAM_MRXFIFO_MASK) >> LPI2C_PARAM_MRXFIFO_SHIFT;
    tmp = 1U << tmp;     /* RX FIFO size = 2^MRXFIFO */
    return (uint16_t)tmp;
}


/*!
 * @brief Get the size of the Master Transmit FIFO
 * 
 * This function returns the size of the Master Transmit FIFO, always a power of 2.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  Master Transmit FIFO Size
 */
static inline uint16_t  LPI2C_HAL_GetMasterTxFIFOSize(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->PARAM;
    tmp = (tmp & LPI2C_PARAM_MTXFIFO_MASK) >> LPI2C_PARAM_MTXFIFO_SHIFT;
    tmp = 1U << tmp;      /* TX FIFO size = 2^MTXFIFO */
    return (uint16_t)tmp;
}


/*!
 * @brief Reset the master receive FIFO
 * 
 * This function empties the receive FIFO of the LPI2C master.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterRxFIFOResetCmd(LPI2C_Type *baseAddr)
{
    BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_RRF_SHIFT) = (uint32_t)1u;
}


/*!
 * @brief Reset the master transmit FIFO
 * 
 * This function empties the transmit FIFO of the LPI2C master. 
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterTxFIFOResetCmd(LPI2C_Type *baseAddr)
{
    BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_RTF_SHIFT) = (uint32_t)1u;
}


/*!
 * @brief Set the master behaviour in Debug mode 
 * 
 * This function enables of disables master functionality when the CPU is in debug mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable the LPI2C master in debug mode
 */
static inline void LPI2C_HAL_MasterSetDebugMode(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_DBGEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Set the master behaviour in Doze mode 
 * 
 * This function enables of disables master functionality in doze mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable the LPI2C master in doze mode
 */
static inline void LPI2C_HAL_MasterSetDozeMode(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_DOZEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Set/clear the master reset command
 *
 * Calling this function with enable parameter set to true resets all internal 
 * master logic and registers, except the Master Control Register. The reset state 
 * persists until this function is called with enable parameter set to false.
 *
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies the reset state of the LPI2C master logic
 */
static inline void LPI2C_HAL_MasterSetSoftwareReset(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_RST_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Enable or disable the LPI2C master
 * 
 * This function enables or disables the LPI2C module in master mode. If the module 
 * is enabled, the transmit FIFO  is not empty and the I2C bus is idle, then 
 * the LPI2C master will immediately initiate a transfer on the I2C bus.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable the LPI2C master
 */
static inline void LPI2C_HAL_MasterSetEnable(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_MEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the debug mode setting for the LPI2C master
 * 
 * This function returns the current debug mode setting for the LPI2C master.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the debug mode setting for the LPI2C master
 */
static inline bool LPI2C_HAL_MasterGetDebugMode(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_DBGEN_SHIFT);
}


/*!
 * @brief Return the doze mode setting for the LPI2C master
 * 
 * This function returns the current doze mode setting for the LPI2C master
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the doze mode setting for the LPI2C master
 */
static inline bool LPI2C_HAL_MasterGetDozeMode(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_DOZEN_SHIFT);
}


/*!
 * @brief Return the reset setting for the LPI2C master
 * 
 * This function returns the state of the LPI2C master software reset bit.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the reset setting for the LPI2C master
 */
static inline bool LPI2C_HAL_MasterGetSoftwareReset(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_RST_SHIFT);
}


/*!
 * @brief Return the enable/disable setting for the LPI2C master
 * 
 * This function checks whether or not the LPI2C master is enabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the enable/disable setting for the LPI2C master
 */
static inline bool LPI2C_HAL_MasterGetEnable(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MCR), LPI2C_MCR_MEN_SHIFT);
}


/*!
 * @brief Return the idle/busy state of the I2C bus
 * 
 * This function returns true if the I2C bus is busy and false if the bus is idle.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the idle/busy state of the I2C bus
 */
static inline bool LPI2C_HAL_MasterGetBusBusyEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_BBF_SHIFT);
}


/*!
 * @brief Return the idle/busy state of the LPI2C master
 * 
 * This function returns true if the LPI2C master is busy and false if 
 * the LPI2C master is idle.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the idle/busy state of the LPI2C master
 */
static inline bool LPI2C_HAL_MasterGetMasterBusyEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_MBF_SHIFT);
}


/*!
 * @brief Indicate the availability of receive data
 * 
 * This function returns true when the number of words in the receive FIFO is greater 
 * than the receive FIFO watermark. See function LPI2C_HAL_MasterSetRxFIFOWatermark()
 * for configuring the receive FIFO watermark.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  receive data ready/not ready
 */
static inline bool LPI2C_HAL_MasterGetReceiveDataReadyEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_RDF_SHIFT);
}


/*!
 * @brief Indicate if the LPI2C master requests more data
 * 
 * This function returns true when the number of words in the transmit FIFO is equal 
 * or less than the transmit FIFO watermark. See function LPI2C_HAL_MasterSetTxFIFOWatermark()
 * for configuring the transmit FIFO watermark.
 *
 * @param baseAddr  base address of the LPI2C module
 * @return  transmit data requested/not requested
 */
static inline bool LPI2C_HAL_MasterGetTransmitDataRequestEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_TDF_SHIFT);
}


/*!
 * @brief Check the occurrence of a data match event
 * 
 * This function returns true if there was a match on the received data according
 * to the current data match option. Received data that is discarded due to commands
 * does not cause this flag to set. See function LPI2C_HAL_MasterSetMatchConfig()
 * for more information on data match configuration.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a data match event
 */
static inline bool LPI2C_HAL_MasterGetDataMatchEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_DMF_SHIFT);
}


/*!
 * @brief Check the occurrence of a pin low timeout event
 * 
 * This function returns true if SCL and/or SDA input is low for more than PINLOW cycles
 * This event can occur even when the LPI2C master is idle.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a pin low timeout event
 */
static inline bool LPI2C_HAL_MasterGetPinLowTimeoutEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_PLTF_SHIFT);
}


/*!
 * @brief Check the occurrence of a FIFO error event
 * 
 * This function returns true if the LPI2C master detects an attempt to send or 
 * receive data without first generating a (repeated) START condition. This can 
 * occur if the transmit FIFO underflows when the AUTOSTOP bit is set. When this 
 * flag is set, the LPI2C master will send a STOP condition (if busy) and will 
 * not initiate a new START condition until this flag has been cleared.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a FIFO error event
 */
static inline bool LPI2C_HAL_MasterGetFIFOErrorEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_FEF_SHIFT);
}


/*!
 * @brief Check the occurrence of an arbitration lost event
 * 
 * This function returns true if the LPI2C master detects an arbitration lost
 * condition, as defined by the I2C standard. When this flag sets, the LPI2C 
 * master will release the bus (go idle) and will not initiate a new START 
 * condition until this flag has been cleared.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of an arbitration lost event
 */
static inline bool LPI2C_HAL_MasterGetArbitrationLostEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_ALF_SHIFT);
}


/*!
 * @brief Check the occurrence of an unexpected NACK event
 * 
 * This function returns true if the LPI2C master detects a NACK when 
 * transmitting an address or data. If a NACK is expected for a given address 
 * (as configured by the command word) then the flag will set if a NACK is not
 * generated. When set, the master will transmit a STOP condition and will not 
 * initiate a new START condition until this flag has been cleared.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of an unexpected NACK event
 */
static inline bool LPI2C_HAL_MasterGetNACKDetectEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_NDF_SHIFT);
}


/*!
 * @brief Check the occurrence of a STOP detect event
 * 
 * This function returns true if the LPI2C master has generated a STOP condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a STOP detect event
 */
static inline bool LPI2C_HAL_MasterGetSTOPDetectEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_SDF_SHIFT);
}


/*!
 * @brief Check the occurrence of an end packet event
 * 
 * This function returns true if the LPI2C master has generated a 
 * repeated START or a STOP condition. It does not return true when 
 * the master first generates a START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of an end packet event
 */
static inline bool LPI2C_HAL_MasterGetEndPacketEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MSR), LPI2C_MSR_EPF_SHIFT);
}


/*!
 * @brief Clear the data match event flag
 * 
 * This function clears the data match event.
 *
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterClearDataMatchEvent(LPI2C_Type *baseAddr)
{
    baseAddr->MSR = (uint32_t)(1u << LPI2C_MSR_DMF_SHIFT);
}


/*!
 * @brief Clear the pin low timeout event flag
 * 
 * This function clears the pin low timeout event. This event cannot be cleared for
 * as long as the pin low timeout condition continues, and must be cleared before 
 * the LPI2C master can initiate a START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterClearPinLowTimeoutEvent(LPI2C_Type *baseAddr)
{
    baseAddr->MSR = (uint32_t)(1u << LPI2C_MSR_PLTF_SHIFT);
}


/*!
 * @brief Clear the FIFO error event flag
 * 
 * This function clears the FIFO error event. This event must be cleared before 
 * the LPI2C master can initiate a START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterClearFIFOErrorEvent(LPI2C_Type *baseAddr)
{
    baseAddr->MSR = (uint32_t)(1u << LPI2C_MSR_FEF_SHIFT);
}


/*!
 * @brief Clear the arbitration lost event flag
 * 
 * This function clears the arbitration lost event. This event must be cleared 
 * before the LPI2C master can initiate a START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterClearArbitrationLostEvent(LPI2C_Type *baseAddr)
{
    baseAddr->MSR = (uint32_t)(1u << LPI2C_MSR_ALF_SHIFT);
}


/*!
 * @brief Clear the unexpected NACK event flag
 * 
 * This function clears the unexpected NACK event. This event must be cleared 
 * before the LPI2C master can initiate a START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterClearNACKDetectEvent(LPI2C_Type *baseAddr)
{
    baseAddr->MSR = (uint32_t)(1u << LPI2C_MSR_NDF_SHIFT);
}


/*!
 * @brief Clear the STOP detect event flag
 * 
 * This function clears the STOP detect event.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterClearSTOPDetectEvent(LPI2C_Type *baseAddr)
{
    baseAddr->MSR = (uint32_t)(1u << LPI2C_MSR_SDF_SHIFT);
}


/*!
 * @brief Clear the end packet event flag
 * 
 * This function clears the end packet event.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_MasterClearEndPacketEvent(LPI2C_Type *baseAddr)
{
    baseAddr->MSR = (uint32_t)(1u << LPI2C_MSR_EPF_SHIFT);
}


/*!
 * @brief Enable/disable receive data DMA requests
 * 
 * This function enables or disables generation of Rx DMA requests when data
 * can be read from the receive FIFO, as configured by the receive FIFO watermark.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable DMA requests
 */
static inline void LPI2C_HAL_MasterSetRxDMA(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MDER), LPI2C_MDER_RDDE_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Enable/disable transmit data DMA requests
 * 
 * This function enables or disables generation of Tx DMA requests when data
 * can be written to the transmit FIFO, as configured by the transmit FIFO watermark.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable DMA requests
 */
static inline void LPI2C_HAL_MasterSetTxDMA(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MDER), LPI2C_MDER_TDDE_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Check if receive data DMA requests are enabled
 * 
 * This function returns true if Rx DMA requests are enabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  enabled/disabled status of receive data DMA requests
 */
static inline bool LPI2C_HAL_MasterGetRxDMA(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MDER), LPI2C_MDER_RDDE_SHIFT);
}


/*!
 * @brief Check if transmit data DMA requests are enabled
 * 
 * This function returns true if Tx DMA requests are enabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  enabled/disabled status of transmit data DMA requests
 */
static inline bool LPI2C_HAL_MasterGetTxDMA(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MDER), LPI2C_MDER_TDDE_SHIFT);
}


/*!
 * @brief Enable or disable specified LPI2C master interrupts
 * 
 * This function can enable or disable one or more master interrupt sources 
 * specified by the interrupts parameter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param interrupts  interrupts to be enabled or disabled; 
 *  must be a bitwise or between one or more of the following constants: 
 *  - LPI2C_HAL_MASTER_DATA_MATCH_INT          - Data Match Interrupt
 *  - LPI2C_HAL_MASTER_PIN_LOW_TIMEOUT_INT     - Pin Low Timeout Interrupt
 *  - LPI2C_HAL_MASTER_FIFO_ERROR_INT          - FIFO Error Interrupt
 *  - LPI2C_HAL_MASTER_ARBITRATION_LOST_INT    - Arbitration Lost Interrupt
 *  - LPI2C_HAL_MASTER_NACK_DETECT_INT         - NACK Detect Interrupt
 *  - LPI2C_HAL_MASTER_STOP_DETECT_INT         - STOP Detect Interrupt
 *  - LPI2C_HAL_MASTER_END_PACKET_INT          - End Packet Interrupt
 *  - LPI2C_HAL_MASTER_RECEIVE_DATA_INT        - Receive Data Interrupt
 *  - LPI2C_HAL_MASTER_TRANSMIT_DATA_INT       - Transmit Data Interrupt
 * @param enable  specifies whether to enable or disable specified interrupts
 */
static inline void LPI2C_HAL_MasterSetInt(LPI2C_Type *baseAddr, uint32_t interrupts, bool enable)
{
    uint32_t tmp = baseAddr->MIER;

    if (enable == true)
    {
        tmp |= interrupts;
    }
    else
    {
        tmp &= ~interrupts;
    }
    baseAddr->MIER = tmp;
}


/*!
 * @brief Return the state of the specified LPI2C master interrupt
 * 
 * This function returns the enabled/disabled state of the master interrupt 
 * source specified by the interrupt parameter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param interrupts  interrupt for which the check is made;
 *  must be one of the following constants:
 *  - LPI2C_HAL_MASTER_DATA_MATCH_INT          - Data Match Interrupt
 *  - LPI2C_HAL_MASTER_PIN_LOW_TIMEOUT_INT     - Pin Low Timeout Interrupt
 *  - LPI2C_HAL_MASTER_FIFO_ERROR_INT          - FIFO Error Interrupt
 *  - LPI2C_HAL_MASTER_ARBITRATION_LOST_INT    - Arbitration Lost Interrupt
 *  - LPI2C_HAL_MASTER_NACK_DETECT_INT         - NACK Detect Interrupt
 *  - LPI2C_HAL_MASTER_STOP_DETECT_INT         - STOP Detect Interrupt
 *  - LPI2C_HAL_MASTER_END_PACKET_INT          - End Packet Interrupt
 *  - LPI2C_HAL_MASTER_RECEIVE_DATA_INT        - Receive Data Interrupt
 *  - LPI2C_HAL_MASTER_TRANSMIT_DATA_INT       - Transmit Data Interrupt
 * @return  enable/disable state of specified interrupt
 */
static inline bool LPI2C_HAL_MasterGetInt(LPI2C_Type *baseAddr, uint32_t interrupts)
{
    uint32_t tmp = baseAddr->MIER;

    if (tmp | interrupts)
    {
        return true;
    }
    else
    {
        return false;
    }
}


