arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpi2c_hal.h
/*!
 * @brief Control the discarding of data that does not match the configured criteria
 * 
 * This function configures the policy for handling data that does not match the configuration 
 * criteria. Received data can be stored in the receive FIFO either unconditionally or based 
 * on the data match event. See function LPI2C_HAL_MasterGetDataMatchEvent() for more information on the 
 * data match event.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param rxDataMatch  specifies whether or not to drop non-matching data
 */
static inline void LPI2C_HAL_MasterSetRxDataMatch(LPI2C_Type *baseAddr, lpi2c_rx_data_match_t rxDataMatch)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_RDMO_SHIFT) = (uint32_t)rxDataMatch;
}


/*!
 * @brief Return the current data match discarding policy
 * 
 * This function returns the currently configured policy for data that does not 
 * match the configured criteria
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the current policy for non-matching data
 */
static inline lpi2c_rx_data_match_t LPI2C_HAL_MasterGetRxDataMatch(LPI2C_Type *baseAddr)
{
    return (lpi2c_rx_data_match_t)BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_RDMO_SHIFT);
}


/*!
 * @brief Set the circular FIFO mode for the transmit FIFO
 * 
 * This function enables or disables the circular FIFO feature of the module. When enabled, 
 * the transmit FIFO read pointer is saved to a temporary register. The transmit FIFO will 
 * be emptied as normal, but once the LPI2C master is idle and the transmit FIFO is empty, 
 * then the read pointer value will be restored from the temporary register. This will 
 * cause the contents of the transmit FIFO to be cycled through repeatedly. If AUTOSTOP 
 * is set, a STOP condition will be sent whenever the transmit FIFO is empty and the read 
 * pointer is restored.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable/disable circular FIFO mode for the transmit FIFO
 */
static inline void LPI2C_HAL_MasterSetCircularFIFO(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_CIRFIFO_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the circular FIFO mode for the transmit FIFO
 * 
 * This function returns the current setting for the circular FIFO feature of the module.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  circular FIFO mode for the transmit FIFO
 */
static inline bool LPI2C_HAL_MasterGetCircularFIFO(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_CIRFIFO_SHIFT);
}


/*!
 * @brief Set the source of the host request input
 * 
 * This function selects the source of the host request input.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param source  selected source of the host request input
 */
static inline void LPI2C_HAL_MasterSetHreqSelect(LPI2C_Type *baseAddr, lpi2c_hreq_source_t source)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_HRSEL_SHIFT) = (uint32_t)source;
}


/*!
 * @brief Set the polarity of the host request input pin
 * 
 * This function configures the polarity of the host request input pin.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param polarity  selected polarity of the host request input
 */
static inline void LPI2C_HAL_MasterSetHreqPolarity(LPI2C_Type *baseAddr, lpi2c_hreq_polarity_t polarity)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_HRPOL_SHIFT) = (uint32_t)polarity;
}


/*!
 * @brief Enable/disable the host request feature
 * 
 * This function enables or disables the host request signal. When enabled, the LPI2C 
 * master will only initiate a START condition if the host request input is asserted and 
 * the bus is idle. A repeated START is not affected by the host request.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable/disable the host request feature
 */
static inline void LPI2C_HAL_MasterSetHreqEnable(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_HREN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the source of the host request input
 * 
 * This function returns the currently configured source for the host request input.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  source of the host request input
 */
static inline lpi2c_hreq_source_t LPI2C_HAL_MasterGetHreqSelect(LPI2C_Type *baseAddr)
{
    return (lpi2c_hreq_source_t)BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_HRSEL_SHIFT);
}


/*!
 * @brief Return the polarity of the host request input pin
 * 
 * This function returns the currently configured polarity for the host request input.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  polarity of the host request input
 */
static inline lpi2c_hreq_polarity_t LPI2C_HAL_MasterGetHreqPolarity(LPI2C_Type *baseAddr)
{
    return (lpi2c_hreq_polarity_t)BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_HRPOL_SHIFT);
}


/*!
 * @brief Return the enable/disable state the host request feature
 * 
 * This function returns true if the host request signal is enabled, and false if it is disabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  enable/disable state the host request feature
 */
static inline bool LPI2C_HAL_MasterGetHreqEnable(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MCFGR0), LPI2C_MCFGR0_HREN_SHIFT);
}


/*!
 * @brief Set the pin mode of the module
 * 
 * This function sets the pin mode of the module. See type lpi2c_pin_config_t for 
 * a description of available modes.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param configuration  pin mode of the module
 */
static inline void LPI2C_HAL_MasterSetPinConfig(LPI2C_Type *baseAddr, lpi2c_pin_config_t configuration)
{
    uint32_t tmp = baseAddr->MCFGR1;
    tmp &= ~(LPI2C_MCFGR1_PINCFG_MASK);
    tmp |= LPI2C_MCFGR1_PINCFG(configuration);
    baseAddr->MCFGR1 = tmp;
}


/*!
 * @brief Return the pin mode of the module
 * 
 * This function returns the currently configured pin mode for the module.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  pin mode of the module
 */
static inline lpi2c_pin_config_t LPI2C_HAL_MasterGetPinConfig(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCFGR1;
    tmp = (tmp & LPI2C_MCFGR1_PINCFG_MASK) >> LPI2C_MCFGR1_PINCFG_SHIFT;
    return (lpi2c_pin_config_t)tmp;
}


/*!
 * @brief Set the match mode of the module
 * 
 * This function configures the rules for matching incoming data against the two match 
 * values, MATCH0 and MATCH1. A successful match will trigger a data match event. 
 * See type lpi2c_match_config_t for a description of all available match options.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param configuration  match mode of the module
 */
static inline void LPI2C_HAL_MasterSetMatchConfig(LPI2C_Type *baseAddr, lpi2c_match_config_t configuration)
{
    uint32_t tmp = baseAddr->MCFGR1;
    tmp &= ~(LPI2C_MCFGR1_MATCFG_MASK);
    tmp |= LPI2C_MCFGR1_MATCFG(configuration);
    baseAddr->MCFGR1 = tmp;
}


/*!
 * @brief Return the match mode of the module
 * 
 * This function returns the currently configured match mode for the module.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  match mode of the module
 */
static inline lpi2c_match_config_t LPI2C_HAL_MasterGetMatchConfig(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCFGR1;
    tmp = (tmp & LPI2C_MCFGR1_MATCFG_MASK) >> LPI2C_MCFGR1_MATCFG_SHIFT;
    return (lpi2c_match_config_t)tmp;
}


/*!
 * @brief Set the timeout configuration of the module
 * 
 * This function configures the condition for triggering a pin low timeout event. 
 * Selects between monitoring only SCL for timeout, or both SCL and SDA.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param configuration  timeout configuration of the module
 */
static inline void LPI2C_HAL_MasterSetTimeoutConfig(LPI2C_Type *baseAddr, lpi2c_timeout_config_t configuration)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR1), LPI2C_MCFGR1_TIMECFG_SHIFT) = (uint32_t)configuration;
}


/*!
 * @brief Return the timeout configuration of the module
 * 
 * This function returns the current pin low timeout configuration for the module.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  timeout configuration of the module
 */
static inline lpi2c_timeout_config_t LPI2C_HAL_MasterGetTimeoutConfig(LPI2C_Type *baseAddr)
{
    return (lpi2c_timeout_config_t)BITBAND_ACCESS32(&(baseAddr->MCFGR1), LPI2C_MCFGR1_TIMECFG_SHIFT);
}


/*!
 * @brief Configure the reaction of the module on NACK reception
 * 
 * This function configures how the LPI2C master reacts when receiving a NACK. NACK responses can 
 * be treated normally or ignored. In Ultra-Fast mode it is necessary to configure the module to 
 * ignore NACK responses.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param configuration  set reaction of the module on NACK reception
 */
static inline void LPI2C_HAL_MasterSetNACKConfig(LPI2C_Type *baseAddr, lpi2c_nack_config_t configuration)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR1), LPI2C_MCFGR1_IGNACK_SHIFT) = (uint32_t)configuration;
}


/*!
 * @brief Return the reaction of the module on NACK reception
 * 
 * This function returns the currently configured setting for handling NACK reception.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  configured reaction of the module on NACK reception
 */
static inline lpi2c_nack_config_t LPI2C_HAL_MasterGetNACKConfig(LPI2C_Type *baseAddr)
{
    return (lpi2c_nack_config_t)BITBAND_ACCESS32(&(baseAddr->MCFGR1), LPI2C_MCFGR1_IGNACK_SHIFT);
}


/*!
 * @brief Configure the automatic generation of STOP condition
 * 
 * This function can enable or disable the automatic generation of STOP condition. When enabled, 
 * a STOP condition is generated whenever the LPI2C master is busy and the transmit FIFO is 
 * empty. The STOP condition can also be generated using a transmit FIFO command.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable/disable automatic generation of STOP condition
 */
static inline void LPI2C_HAL_MasterSetAutoStopConfig(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->MCFGR1), LPI2C_MCFGR1_AUTOSTOP_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the current setting for automatic generation of STOP condition
 * 
 * This function returns the currently configured setting for automatic generation of 
 * STOP condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  current setting for automatic generation of STOP condition
 */
static inline bool LPI2C_HAL_MasterGetAutoStopConfig(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MCFGR1), LPI2C_MCFGR1_AUTOSTOP_SHIFT);
}


/*!
 * @brief Configure the LPI2C master prescaler
 * 
 * This function configures the clock prescaler used for all LPI2C master logic, 
 * except the digital glitch filters.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param prescaler  LPI2C master prescaler
 */
static inline void LPI2C_HAL_MasterSetPrescaler(LPI2C_Type *baseAddr, lpi2c_master_prescaler_t prescaler)
{
    uint32_t tmp = baseAddr->MCFGR1;
    tmp &= ~(LPI2C_MCFGR1_PRESCALE_MASK);
    tmp |= LPI2C_MCFGR1_PRESCALE(prescaler);
    baseAddr->MCFGR1 = tmp;
}


/*!
 * @brief Return the LPI2C master prescaler
 * 
 * This function returns the currently configured clock prescaler.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  LPI2C master prescaler
 */
static inline lpi2c_master_prescaler_t LPI2C_HAL_MasterGetPrescaler(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCFGR1;
    tmp = (tmp & LPI2C_MCFGR1_PRESCALE_MASK) >> LPI2C_MCFGR1_PRESCALE_SHIFT;
    return (lpi2c_master_prescaler_t)tmp;
}


/*!
 * @brief Configure the LPI2C SDA glitch filter
 * 
 * This function configures the I2C master digital glitch filters for SDA input. 
 * A configuration of 0 will disable the glitch filter. Glitches equal to or less than 
 * FILTSDA cycles long will be filtered out and ignored. The latency through the glitch 
 * filter is equal to FILTSDA cycles and must be configured less than the minimum SCL 
 * low or high period.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the LPI2C SDA glitch filter
 */
static inline void LPI2C_HAL_MasterSetSDAGlitchFilter(LPI2C_Type *baseAddr, uint8_t cycles)
{
    uint32_t tmp = baseAddr->MCFGR2;
    tmp &= ~(LPI2C_MCFGR2_FILTSDA_MASK);
    tmp |= LPI2C_MCFGR2_FILTSDA(cycles);
    baseAddr->MCFGR2 = tmp;
}


/*!
 * @brief Return the LPI2C SDA glitch filter configuration
 * 
 * This function returns the currently configured master SDA glitch filter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the LPI2C SDA glitch filter
 */
static inline uint8_t LPI2C_HAL_MasterGetSDAGlitchFilter(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCFGR2;
    tmp = (tmp & LPI2C_MCFGR2_FILTSDA_MASK) >> LPI2C_MCFGR2_FILTSDA_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Configure the LPI2C SCL glitch filter
 * 
 * This function configures the I2C master digital glitch filters for SCL input,
 * a configuration of 0 will disable the glitch filter. Glitches equal to or less 
 * than FILTSCL cycles long will be filtered out and ignored. The latency through 
 * the glitch filter is equal to FILTSCL cycles and must be configured less than 
 * the minimum SCL low or high period.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the LPI2C SCL glitch filter
 */
static inline void LPI2C_HAL_MasterSetSCLGlitchFilter(LPI2C_Type *baseAddr, uint8_t cycles)
{
    uint32_t tmp = baseAddr->MCFGR2;
    tmp &= ~(LPI2C_MCFGR2_FILTSCL_MASK);
    tmp |= LPI2C_MCFGR2_FILTSCL(cycles);
    baseAddr->MCFGR2 = tmp;
}


/*!
 * @brief Return the LPI2C SCL glitch filter configuration
 * 
 * This function returns the currently configured SCL glitch filter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the LPI2C SCL glitch filter
 */
static inline uint8_t LPI2C_HAL_MasterGetSCLGlitchFilter(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCFGR2;
    tmp = (tmp & LPI2C_MCFGR2_FILTSCL_MASK) >> LPI2C_MCFGR2_FILTSCL_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Configure the bus idle timeout
 *
 * This function configures the bus idle timeout period in clock cycles. If both 
 * SCL and SDA are high for longer than the configured timeout in cycles, then the 
 * I2C bus is assumed to be idle and the master can generate a START condition. 
 * When set to zero, this feature is disabled.
 *
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the bus idle timeout
 */
static inline void LPI2C_HAL_MasterSetBusIdleTimeout(LPI2C_Type *baseAddr, uint16_t cycles)
{
    uint32_t tmp = baseAddr->MCFGR2;
    tmp &= ~(LPI2C_MCFGR2_BUSIDLE_MASK);
    tmp |= LPI2C_MCFGR2_BUSIDLE(cycles);
    baseAddr->MCFGR2 = tmp;
}


/*!
 * @brief Return the bus idle timeout configuration
 * 
 * This function returns the currently configured bus idle timeout.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the bus idle timeout
 */
static inline uint16_t LPI2C_HAL_MasterGetBusIdleTimeout(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCFGR2;
    tmp = (tmp & LPI2C_MCFGR2_BUSIDLE_MASK) >> LPI2C_MCFGR2_BUSIDLE_SHIFT;
    return (uint16_t)tmp;
}


/*!
 * @brief Configure the pin low timeout
 * 
 * This function configures the pin low timeout period in clock cycles. If SCL and/or SDA 
 * is low for longer than the pin low timeout cycles then PLTF is set. Timeout value will 
 * be truncated to a multiple of 256. When set to zero, this feature is disabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the pin low timeout; will be truncated to a multiple of 256
 */
static inline void LPI2C_HAL_MasterSetPinLowTimeout(LPI2C_Type *baseAddr, uint32_t cycles)
{
    baseAddr->MCFGR3 = cycles;
}


/*!
 * @brief Return the pin low timeout configuration
 * 
 * This function returns the currently configured pin low timeout.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the pin low timeout
 */
static inline uint32_t LPI2C_HAL_MasterGetPinLowTimeout(LPI2C_Type *baseAddr)
{
    return (uint32_t)(baseAddr->MCFGR3);
}


/*!
 * @brief Set the MATCH0 value for the data match feature
 * 
 * This function sets the MATCH0 value for comparing against the received data 
 * when receive data match is enabled. See function LPI2C_HAL_MasterSetMatchConfig()
 * for details on how this value is used.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  MATCH0 value
 */
static inline void LPI2C_HAL_MasterSetMatch0(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MDMR;
    tmp &= ~(LPI2C_MDMR_MATCH0_MASK);
    tmp |= LPI2C_MDMR_MATCH0(value);
    baseAddr->MDMR = tmp;
}


/*!
 * @brief Return the MATCH0 value for the data match feature
 * 
 * This function returns the currently configured value for MATCH0.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  MATCH0 value
 */
static inline uint8_t LPI2C_HAL_MasterGetMatch0(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MDMR;
    tmp = (tmp & LPI2C_MDMR_MATCH0_MASK) >> LPI2C_MDMR_MATCH0_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the MATCH1 value for the data match feature
 * 
 * This function sets the MATCH1 value for comparing against the received data 
 * when receive data match is enabled. See function LPI2C_HAL_MasterSetMatchConfig()
 * for details on how this value is used.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  MATCH1 value
 */
static inline void LPI2C_HAL_MasterSetMatch1(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MDMR;
    tmp &= ~(LPI2C_MDMR_MATCH1_MASK);
    tmp |= LPI2C_MDMR_MATCH1(value);
    baseAddr->MDMR = tmp;
}


/*!
 * @brief Return the MATCH1 value for the data match feature
 * 
 * This function returns the currently configured value for MATCH1.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  MATCH1 value
 */
static inline uint8_t LPI2C_HAL_MasterGetMatch1(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MDMR;
    tmp = (tmp & LPI2C_MDMR_MATCH1_MASK) >> LPI2C_MDMR_MATCH1_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the data hold time for SDA
 * 
 * This function sets the minimum number of cycles (minus one) that is used as the 
 * data hold time for SDA. Must be configured less than the minimum SCL low period.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  value of the data hold time for SDA
 */
static inline void LPI2C_HAL_MasterSetDataValidDelay(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp &= ~(LPI2C_MCCR0_DATAVD_MASK);
    tmp |= LPI2C_MCCR0_DATAVD(value);
    baseAddr->MCCR0 = tmp;
}


/*!
 * @brief Return the configured data hold time for SDA
 * 
 * This function returns the currently configured value for SDA data hold time.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  value of the data hold time for SDA
 */
static inline uint8_t LPI2C_HAL_MasterGetDataValidDelay(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp = (tmp & LPI2C_MCCR0_DATAVD_MASK) >> LPI2C_MCCR0_DATAVD_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the setup and hold delay for a START / STOP condition
 * 
 * This function configures the Minimum number of cycles (minus one) that is used 
 * by the master as the setup and hold time for a (repeated) START condition and setup 
 * time for a STOP condition. The setup time is extended by the time it takes to detect 
 * a rising edge on the external SCL pin. Ignoring any additional board delay due to 
 * external loading, this is equal to (2 + FILTSCL) / 2^PRESCALE cycles.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  setup and hold time for a START / STOP condition
 */
static inline void LPI2C_HAL_MasterSetSetupHoldDelay(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp &= ~(LPI2C_MCCR0_SETHOLD_MASK);
    tmp |= LPI2C_MCCR0_SETHOLD(value);
    baseAddr->MCCR0 = tmp;
}


/*!
 * @brief Return the configured setup and hold time 
 * 
 * This function returns the currently configured value for setup and hold delay 
 * for a START / STOP condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  setup and hold time for a START / STOP condition
 */
static inline uint8_t LPI2C_HAL_MasterGetSetupHoldDelay(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp = (tmp & LPI2C_MCCR0_SETHOLD_MASK) >> LPI2C_MCCR0_SETHOLD_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the minimum clock high period
 * 
 * This function configures the minimum number of cycles (minus one) that the 
 * SCL clock is driven high by the master. The SCL high time is extended by the 
 * time it takes to detect a rising edge on the external SCL pin. Ignoring any 
 * additional board delay due to external loading, this is equal to 
 * (2 + FILTSCL) / 2^PRESCALE cycles.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  minimum clock high period
 */
static inline void LPI2C_HAL_MasterSetClockHighPeriod(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp &= ~(LPI2C_MCCR0_CLKHI_MASK);
    tmp |= LPI2C_MCCR0_CLKHI(value);
    baseAddr->MCCR0 = tmp;
}


/*!
 * @brief Return the configured minimum clock high period
 * 
 * This function returns the currently configured value for clock high period.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  minimum clock high period
 */
static inline uint8_t LPI2C_HAL_MasterGetClockHighPeriod(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp = (tmp & LPI2C_MCCR0_CLKHI_MASK) >> LPI2C_MCCR0_CLKHI_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the minimum clock low period
 * 
 * This function configures the minimum number of cycles (minus one) that the 
 * SCL clock is driven low by the master. This value is also used for the 
 * minimum bus free time between a STOP and a START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  minimum clock low period
 */
static inline void LPI2C_HAL_MasterSetClockLowPeriod(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp &= ~(LPI2C_MCCR0_CLKLO_MASK);
    tmp |= LPI2C_MCCR0_CLKLO(value);
    baseAddr->MCCR0 = tmp;
}


/*!
 * @brief Return the configured minimum clock low period
 * 
 * This function returns the currently configured value for clock low period.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  minimum clock low period
 */
static inline uint8_t LPI2C_HAL_MasterGetClockLowPeriod(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR0;
    tmp = (tmp & LPI2C_MCCR0_CLKLO_MASK) >> LPI2C_MCCR0_CLKLO_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the data hold time for SDA in high-speed mode
 * 
 * This function sets the minimum number of cycles (minus one) that is used as the 
 * data hold time for SDA in High-Speed mode. Must be configured less than the 
 * minimum SCL low period.
 * This setting only has effect during High-Speed mode transfers.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  value of the data hold time for SDA
 */
static inline void LPI2C_HAL_MasterSetDataValidDelayHS(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp &= ~(LPI2C_MCCR1_DATAVD_MASK);
    tmp |= LPI2C_MCCR1_DATAVD(value);
    baseAddr->MCCR1 = tmp;
}


