arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpi2c_hal.h
/*!
 * @brief Return the configured data hold time for SDA in high-speed mode
 * 
 * This function returns the currently configured value for SDA data hold time
 * in high-speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  value of the data hold time for SDA
 */
static inline uint8_t LPI2C_HAL_MasterGetDataValidDelayHS(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp = (tmp & LPI2C_MCCR1_DATAVD_MASK) >> LPI2C_MCCR1_DATAVD_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the setup and hold time for a START / STOP condition in high-speed mode
 * 
 * This function configures the Minimum number of cycles (minus one) that is used 
 * by the master as the setup and hold time for a (repeated) START condition and setup 
 * time for a STOP condition. The setup time is extended by the time it takes to detect 
 * a rising edge on the external SCL pin. Ignoring any additional board delay due to 
 * external loading, this is equal to (2 + FILTSCL) / 2^PRESCALE cycles.
 * This setting only has effect during High-Speed mode transfers.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  setup and hold time for a START / STOP condition
 */
static inline void LPI2C_HAL_MasterSetSetupHoldDelayHS(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp &= ~(LPI2C_MCCR1_SETHOLD_MASK);
    tmp |= LPI2C_MCCR1_SETHOLD(value);
    baseAddr->MCCR1 = tmp;
}


/*!
 * @brief Return the configured setup and hold time in high-speed mode
 * 
 * This function returns the currently configured value for setup and hold delay
 * for a START / STOP condition in high-speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  setup and hold time for a START / STOP condition
 */
static inline uint8_t LPI2C_HAL_MasterGetSetupHoldDelayHS(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp = (tmp & LPI2C_MCCR1_SETHOLD_MASK) >> LPI2C_MCCR1_SETHOLD_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the minimum clock high period in high-speed mode
 * 
 * This function configures the minimum number of cycles (minus one) that the 
 * SCL clock is driven high by the master. The SCL high time is extended by the 
 * time it takes to detect a rising edge on the external SCL pin. Ignoring any 
 * additional board delay due to external loading, this is equal to 
 * (2 + FILTSCL) / 2^PRESCALE cycles.
 * This setting only has effect during High-Speed mode transfers.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  minimum clock high period
 */
static inline void LPI2C_HAL_MasterSetClockHighPeriodHS(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp &= ~(LPI2C_MCCR1_CLKHI_MASK);
    tmp |= LPI2C_MCCR1_CLKHI(value);
    baseAddr->MCCR1 = tmp;
}


/*!
 * @brief Return the configured minimum clock high period in high-speed mode
 * 
 * This function returns the currently configured value for clock high period
 * in high-speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  minimum clock high period
 */
static inline uint8_t LPI2C_HAL_MasterGetClockHighPeriodHS(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp = (tmp & LPI2C_MCCR1_CLKHI_MASK) >> LPI2C_MCCR1_CLKHI_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the minimum clock low period in high-speed mode
 * 
 * This function configures the minimum number of cycles (minus one) that the 
 * SCL clock is driven low by the master. This value is also used for the 
 * minimum bus free time between a STOP and a START condition.
 * This setting only has effect during High-Speed mode transfers.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  minimum clock low period
 */
static inline void LPI2C_HAL_MasterSetClockLowPeriodHS(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp &= ~(LPI2C_MCCR1_CLKLO_MASK);
    tmp |= LPI2C_MCCR1_CLKLO(value);
    baseAddr->MCCR1 = tmp;
}


/*!
 * @brief Return the configured minimum clock low period in high-speed mode
 * 
 * This function returns the currently configured value for clock low period
 * in high-speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  minimum clock low period
 */
static inline uint8_t LPI2C_HAL_MasterGetClockLowPeriodHS(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MCCR1;
    tmp = (tmp & LPI2C_MCCR1_CLKLO_MASK) >> LPI2C_MCCR1_CLKLO_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the receive FIFO watermark
 * 
 * This function configures the receive FIFO watermark. Whenever the number of words in the receive 
 * FIFO is greater than the receive FIFO watermark, a receive data ready event is generated.
 * Writing a value equal or greater than the FIFO size will be truncated.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  number of words in the receive FIFO that will cause the receive data flag to be set
 */
static inline void LPI2C_HAL_MasterSetRxFIFOWatermark(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MFCR;
    tmp &= ~(LPI2C_MFCR_RXWATER_MASK);
    tmp |= LPI2C_MFCR_RXWATER(value);
    baseAddr->MFCR = tmp;
}


/*!
 * @brief Return the configured receive FIFO watermark
 * 
 * This function returns the currently configured value for receive FIFO watermark
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of words in the receive FIFO that will cause the receive data flag to be set
 */
static inline uint8_t LPI2C_HAL_MasterGetRxFIFOWatermark(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MFCR;
    tmp = (tmp & LPI2C_MFCR_RXWATER_MASK) >> LPI2C_MFCR_RXWATER_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Set the transmit FIFO watermark
 * 
 * This function configures the transmit FIFO watermark. Whenever the number of words in the transmit 
 * FIFO is greater than the transmit FIFO watermark, a transmit data request event is generated.
 * Writing a value equal or greater than the FIFO size will be truncated.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param value  number of words in the transmit FIFO that will cause the transmit data flag to be set
 */
static inline void LPI2C_HAL_MasterSetTxFIFOWatermark(LPI2C_Type *baseAddr, uint8_t value)
{
    uint32_t tmp = baseAddr->MFCR;
    tmp &= ~(LPI2C_MFCR_TXWATER_MASK);
    tmp |= LPI2C_MFCR_TXWATER(value);
    baseAddr->MFCR = tmp;
}


/*!
 * @brief Return the configured transmit FIFO watermark
 * 
 * This function returns the currently configured value for transmit FIFO watermark
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of words in the transmit FIFO that will cause the transmit data flag to be set
 */
static inline uint8_t LPI2C_HAL_MasterGetTxFIFOWatermark(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MFCR;
    tmp = (tmp & LPI2C_MFCR_TXWATER_MASK) >> LPI2C_MFCR_TXWATER_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Return the number of words in the receive FIFO
 * 
 * This function returns the number of words currently available in the receive FIFO.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the number of words in the receive FIFO
 */
static inline uint8_t LPI2C_HAL_MasterGetRxFIFOCount(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MFSR;
    tmp = (tmp & LPI2C_MFSR_RXCOUNT_MASK) >> LPI2C_MFSR_RXCOUNT_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Return the number of words in the transmit FIFO
 * 
 * This function returns the number of words currently available in the transmit FIFO.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the number of words in the transmit FIFO
 */
static inline uint8_t LPI2C_HAL_MasterGetTxFIFOCount(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MFSR;
    tmp = (tmp & LPI2C_MFSR_TXCOUNT_MASK) >> LPI2C_MFSR_TXCOUNT_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Provide commands and data for the LPI2C master
 * 
 * This function stores commands and data in the transmit FIFO and increments the FIFO 
 * write pointer.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cmd  command for the LPI2C master
 * @param data  data for the LPI2C master
 */
static inline void LPI2C_HAL_MasterTransmitCmd(LPI2C_Type *baseAddr, lpi2c_master_command_t cmd, uint8_t data)
{
    baseAddr->MTDR = ((uint32_t)cmd << 8U) + (uint32_t)data;
}


/*!
 * @brief Return the received data
 * 
 * This function returns data received by the I2C master that has not been discarded 
 * due to data match settings or active command, and increments the FIFO read pointer.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  data received by the LPI2C master
 */
static inline uint8_t LPI2C_HAL_MasterGetRxData(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->MRDR;
    tmp = (tmp & LPI2C_MRDR_DATA_MASK) >> LPI2C_MRDR_DATA_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Check if the master receive FIFO is empty
 * 
 * This function checks if the master receive FIFO is empty.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  status of the master receive FIFO
 */
static inline bool LPI2C_HAL_MasterGetRxEmpty(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->MRDR), LPI2C_MRDR_RXEMPTY_SHIFT);
}


/*!
 * @brief Reset the slave receive FIFO
 * 
 * This function empties the receive FIFO of the LPI2C slave.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_SlaveRxFIFOResetCmd(LPI2C_Type *baseAddr)
{
    BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_RRF_SHIFT) = (uint32_t)1u;
}


/*!
 * @brief Reset the slave transmit FIFO
 * 
 * This function empties the transmit FIFO of the LPI2C slave. 
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_SlaveTxFIFOResetCmd(LPI2C_Type *baseAddr)
{
    BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_RTF_SHIFT) = (uint32_t)1u;
}


/*!
 * @brief Configure the slave filter in doze mode
 * 
 * This function enables or disables the digital filter in doze mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable/disable the slave filter in doze mode
 */
static inline void LPI2C_HAL_SlaveSetFilterDoze(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_FILTDZ_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the slave filter configuration in doze mode
 * 
 * This function returns the currently configured settings for the digital filter 
 * in Doze mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  slave filter configuration in doze mode
 */
static inline bool LPI2C_HAL_SlaveGetFilterDoze(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_FILTDZ_SHIFT);
}


/*!
 * @brief Enable/disable the slave filter
 * 
 * This function enables or disables the digital filter and output delay counter 
 * for slave mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable/disable the slave filter
 */
static inline void LPI2C_HAL_SlaveSetFilterEnable(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_FILTEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Check if the slave filter is enabled or disabled
 * 
 * This function returns the currently configured settings for the digital filter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  slave filter configuration
 */
static inline bool LPI2C_HAL_SlaveGetFilterEnable(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_FILTEN_SHIFT);
}


/*!
 * @brief Set/clear the slave reset command
 * 
 * Calling this function with enable parameter set to true will perform a software 
 * reset of the LPI2C slave.
 *
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies the reset state of the LPI2C slave logic
 */
static inline void LPI2C_HAL_SlaveSetSoftwareReset(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_RST_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the reset setting for the LPI2C slave
 * 
 * This function returns the state of the LPI2C slave software reset bit.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the reset state of the LPI2C slave logic
 */
static inline bool LPI2C_HAL_SlaveGetSoftwareReset(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_RST_SHIFT);
}


/*!
 * @brief Enable or disable the LPI2C slave
 * 
 * This function enables or disables the LPI2C module in slave mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable the LPI2C slave
 */
static inline void LPI2C_HAL_SlaveSetEnable(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_SEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the enable/disable setting for the LPI2C slave
 * 
 * This function checks whether or not the LPI2C slave is enabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  the enable/disable setting for the LPI2C slave
 */
static inline bool LPI2C_HAL_SlaveGetEnable(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCR), LPI2C_SCR_SEN_SHIFT);
}


/*!
 * @brief Check the busy state of the bus
 * 
 * This function returns true if the I2C bus is busy and false if the bus is idle.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  busy state of the bus
 */
static inline bool LPI2C_HAL_SlaveGetBusBusyEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_BBF_SHIFT);
}


/*!
 * @brief Check the busy state of the slave
 * 
 * This function returns true if the LPI2C slave is busy and false if 
 * the LPI2C slave is idle.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  busy state of the slave
 */
static inline bool LPI2C_HAL_SlaveGetSlaveBusyEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_SBF_SHIFT);
}


/*!
 * @brief Check the occurrence of an SMBus alert response
 * 
 * This function checks for the detection of a SMBus Alert Response. This event is 
 * cleared by reading the received address - see function LPI2C_HAL_SlaveGetReceivedAddr().
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of an SMBus alert response
 */
static inline bool LPI2C_HAL_SlaveGetSMBusAlertResponseEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_SARF_SHIFT);
}


/*!
 * @brief Check the detection of the general call address
 * 
 * This function checks for the detection of a General Call Address. This event is 
 * cleared by reading the received address - see function LPI2C_HAL_SlaveGetReceivedAddr().
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a general call address detection
 */
static inline bool LPI2C_HAL_SlaveGetGeneralCallEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_GCF_SHIFT);
}


/*!
 * @brief Check the detection of an ADDR1 address match
 * 
 * This function checks for a match of the ADDR1 address, or ADDR0 to ADDR1 range as
 * configured by function LPI2C_HAL_SlaveSetAddrConfig() This event is cleared 
 * by reading the received address - see function LPI2C_HAL_SlaveGetReceivedAddr().
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of an ADDR1 address match
 */
static inline bool LPI2C_HAL_SlaveGetAddressMatch1Event(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_AM1F_SHIFT);
}


/*!
 * @brief Check the detection of an ADDR0 address match
 * 
 * This function checks for a match of the ADDR0 address, as
 * configured by function LPI2C_HAL_SlaveSetAddrConfig() This event is cleared 
 * by reading the received address - see function LPI2C_HAL_SlaveGetReceivedAddr().
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of an ADDR0 address match
 */
static inline bool LPI2C_HAL_SlaveGetAddressMatch0Event(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_AM0F_SHIFT);
}


/*!
 * @brief Check the detection of a FIFO overflow or underflow
 * 
 * This function checks for the occurrence of a slave FIFO overflow or underflow. 
 * This event can only occur if clock stretching is disabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a FIFO overflow or underflow
 */
static inline bool LPI2C_HAL_SlaveGetFIFOErrorEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_FEF_SHIFT);
}


/*!
 * @brief Check the detection of a bit error
 * 
 * This function checks for the occurrence of a bit error event. This event occurs
 * if the LPI2C slave transmits a logic one and detects a logic zero on the I2C bus. The
 * slave will ignore the rest of the transfer until the next (repeated) START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a bit error
 */
static inline bool LPI2C_HAL_SlaveGetBitErrorEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_BEF_SHIFT);
}


/*!
 * @brief Check the detection of a STOP condition
 * 
 * This function checks for the detection of a STOP condition, after the LPI2C slave 
 * matched the last address byte.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a STOP condition
 */
static inline bool LPI2C_HAL_SlaveGetSTOPDetectEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_SDF_SHIFT);
}


/*!
 * @brief Check the detection of a repeated START condition
 * 
 * This function checks for the detection of a repeated START condition, after 
 * the LPI2C slave matched the last address byte. This event does not occur
 * when the slave first detects a START condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a repeated START condition
 */
static inline bool LPI2C_HAL_SlaveGetRepeatedStartEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_RSF_SHIFT);
}


/*!
 * @brief Check if transmitting ACK response is required
 * 
 * This function checks if the LPI2C slave requests the software to provide
 * an ACK or NACK response. This event is cleared by calling function 
 * LPI2C_HAL_SlaveSetTransmitNACK().
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indicates whether or not ACK response is required
 */
static inline bool LPI2C_HAL_SlaveGetTransmitACKEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_TAF_SHIFT);
}


/*!
 * @brief Check the validity of the Address Status Register
 * 
 * This function checks for the detection of a valid address. The event is 
 * cleared by reading the address - see function LPI2C_HAL_SlaveGetReceivedAddr().
 * It can also be cleared by reading the data register, when data register has 
 * been configured to allow address reads - see functions 
 * LPI2C_HAL_SlaveSetRxDataConfig() and LPI2C_HAL_SlaveGetData()
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of the validity of the Address Status Register
 */
static inline bool LPI2C_HAL_SlaveGetAddressValidEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_AVF_SHIFT);
}


/*!
 * @brief Check the availability of receive data
 * 
 * This function checks for the availability of data received by the I2C slave.
 * The event is cleared by reading the received data - see function 
 * LPI2C_HAL_SlaveGetData(). The event is not cleared by calling 
 * LPI2C_HAL_SlaveGetData() if the data register is configured to allow address 
 * reads and an address valid event is active.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of receive data availability
 */
static inline bool LPI2C_HAL_SlaveGetReceiveDataEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_RDF_SHIFT);
}


/*!
 * @brief Check if transmit data is requested
 * 
 * This function checks if the LPI2C slave requests data to transmit. The
 * event is cleared by providing transmit data - see function 
 * LPI2C_HAL_SlaveTransmitData(). The event can also be automatically cleared
 * if the LPI2C module detects a NACK or a repeated START or STOP condition -
 * see function LPI2C_HAL_SlaveSetTxFlagConfig()
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indication of a transmit data request
 */
static inline bool LPI2C_HAL_SlaveGetTransmitDataEvent(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SSR), LPI2C_SSR_TDF_SHIFT);
}


/*!
 * @brief Clear the FIFO overflow or underflow flag
 * 
 * This function clears the FIFO overflow or underflow event.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_SlaveClearFIFOErrorEvent(LPI2C_Type *baseAddr)
{
    baseAddr->SSR = (uint32_t)(1u << LPI2C_SSR_FEF_SHIFT);
}


/*!
 * @brief Clear bit error flag
 * 
 * This function clears the bit error event.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_SlaveClearBitErrorEvent(LPI2C_Type *baseAddr)
{
    baseAddr->SSR = (uint32_t)(1u << LPI2C_SSR_BEF_SHIFT);
}


/*!
 * @brief Clear the STOP detect flag
 * 
 * This function clears the STOP detect event.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_SlaveClearSTOPDetectEvent(LPI2C_Type *baseAddr)
{
    baseAddr->SSR = (uint32_t)(1u << LPI2C_SSR_SDF_SHIFT);
}


/*!
 * @brief Clear the repeated START detect flag
 * 
 * This function clears the repeated START detect event.
 * 
 * @param baseAddr  base address of the LPI2C module
 */
static inline void LPI2C_HAL_SlaveClearRepeatedStartEvent(LPI2C_Type *baseAddr)
{
    baseAddr->SSR = (uint32_t)(1u << LPI2C_SSR_RSF_SHIFT);
}


/*!
 * @brief Enable or disable specified LPI2C slave interrupts
 * 
 * This function can enable or disable one or more slave interrupt sources 
 * specified by the interrupts parameter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param interrupts  interrupts to be enabled or disabled; 
 *  must be a bitwise or between one or more of the following constants: 
 *  - LPI2C_HAL_SLAVE_SMBUS_ALERT_RESPONSE  - SMBus Alert Response Interrupt
 *  - LPI2C_HAL_SLAVE_GENERAL_CALL          - General Call Interrupt
 *  - LPI2C_HAL_SLAVE_ADDRESS_MATCH_1       - Address Match 1 Interrupt
 *  - LPI2C_HAL_SLAVE_ADDRESS_MATCH_0       - Address Match 0 Interrupt
 *  - LPI2C_HAL_SLAVE_FIFO_ERROR            - FIFO Error Interrupt
 *  - LPI2C_HAL_SLAVE_BIT_ERROR             - Bit Error Interrupt
 *  - LPI2C_HAL_SLAVE_STOP_DETECT           - STOP Detect Interrupt
 *  - LPI2C_HAL_SLAVE_REPEATED_START        - Repeated Start Interrupt
 *  - LPI2C_HAL_SLAVE_TRANSMIT_ACK          - Transmit ACK Interrupt
 *  - LPI2C_HAL_SLAVE_ADDRESS_VALID         - Address Valid Interrupt
 *  - LPI2C_HAL_SLAVE_RECEIVE_DATA          - Receive Data Interrupt
 *  - LPI2C_HAL_SLAVE_TRANSMIT_DATA         - Transmit Data Interrupt
 * @param enable  specifies whether to enable or disable specified interrupts
 */
static inline void LPI2C_HAL_SlaveSetInt(LPI2C_Type *baseAddr, uint32_t interrupts, bool enable)
{
    uint32_t tmp = baseAddr->SIER;

    if (enable == true)
    {
        tmp |= interrupts;
    }
    else
    {
        tmp &= ~interrupts;
    }
    baseAddr->SIER = tmp;
}


