arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpi2c_hal.h
/*!
 * @brief Return the state of the specified LPI2C slave interrupt
 * 
 * This function returns the enabled/disabled state of the slave interrupt 
 * source specified by the interrupt parameter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param interrupts  interrupt for which the check is made; 
 *  must be one of the following constants:
 *  - LPI2C_HAL_SLAVE_SMBUS_ALERT_RESPONSE  - SMBus Alert Response Interrupt
 *  - LPI2C_HAL_SLAVE_GENERAL_CALL          - General Call Interrupt
 *  - LPI2C_HAL_SLAVE_ADDRESS_MATCH_1       - Address Match 1 Interrupt
 *  - LPI2C_HAL_SLAVE_ADDRESS_MATCH_0       - Address Match 0 Interrupt
 *  - LPI2C_HAL_SLAVE_FIFO_ERROR            - FIFO Error Interrupt
 *  - LPI2C_HAL_SLAVE_BIT_ERROR             - Bit Error Interrupt
 *  - LPI2C_HAL_SLAVE_STOP_DETECT           - STOP Detect Interrupt
 *  - LPI2C_HAL_SLAVE_REPEATED_START        - Repeated Start Interrupt
 *  - LPI2C_HAL_SLAVE_TRANSMIT_ACK          - Transmit ACK Interrupt
 *  - LPI2C_HAL_SLAVE_ADDRESS_VALID         - Address Valid Interrupt
 *  - LPI2C_HAL_SLAVE_RECEIVE_DATA          - Receive Data Interrupt
 *  - LPI2C_HAL_SLAVE_TRANSMIT_DATA         - Transmit Data Interrupt
 * @return  enable/disable state of specified interrupt
 */
static inline bool LPI2C_HAL_SlaveGetInt(LPI2C_Type *baseAddr, uint32_t interrupts)
{
    uint32_t tmp = baseAddr->SIER;

    if (tmp | interrupts)
    {
        return true;
    }
    else
    {
        return false;
    }
}


/*!
 * @brief Enable/disable slave address valid DMA requests
 * 
 * This function enables or disables generation of Rx DMA requests when a valid
 * address is received. Note that this DMA request is shared with slave receive 
 * data requests, so if both are used the receive data register should be 
 * configured to allow address reads - see function LPI2C_HAL_SlaveSetRxDataConfig()
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable address valid DMA requests
 */
static inline void LPI2C_HAL_SlaveSetAddrDMA(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SDER), LPI2C_SDER_AVDE_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Enable/disable slave receive data DMA requests
 * 
 * This function enables or disables generation of Rx DMA requests when received
 * data is available.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable receive data DMA requests
 */
static inline void LPI2C_HAL_SlaveSetRxDMA(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SDER), LPI2C_SDER_RDDE_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Enable/disable slave transmit data DMA requests
 * 
 * This function enables or disables generation of Tx DMA requests when the module
 * requires more data to transmit.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  specifies whether to enable or disable transmit data DMA requests
 */
static inline void LPI2C_HAL_SlaveSetTxDMA(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SDER), LPI2C_SDER_TDDE_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Check if slave address valid DMA requests are enabled
 * 
 * This function returns true if address valid DMA requests are enabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  enabled/disabled status of address valid DMA requests
 */
static inline bool LPI2C_HAL_SlaveGetAddrDMA(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SDER), LPI2C_SDER_AVDE_SHIFT);
}


/*!
 * @brief Check if slave receive data DMA requests are enabled
 * 
 * This function returns true if receive data DMA requests are enabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  enabled/disabled status of receive data DMA requests
 */
static inline bool LPI2C_HAL_SlaveGetRxDMA(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SDER), LPI2C_SDER_RDDE_SHIFT);
}


/*!
 * @brief Check if slave transmit data DMA requests are enabled
 * 
 * This function returns true if transmit data DMA requests are enabled.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  enabled/disabled status of transmit data DMA requests
 */
static inline bool LPI2C_HAL_SlaveGetTxDMA(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SDER), LPI2C_SDER_TDDE_SHIFT);
}


/*!
 * @brief Control address match configuration
 * 
 * This function configures the condition that will cause an address match to 
 * occur. See type lpi2c_slave_addr_config_t for a description of available options.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param configuration  configures the condition that will cause an address to match
 */
static inline void LPI2C_HAL_SlaveSetAddrConfig(LPI2C_Type *baseAddr, lpi2c_slave_addr_config_t configuration)
{
    uint32_t tmp = baseAddr->SCFGR1;
    tmp &= ~(LPI2C_SCFGR1_ADDRCFG_MASK);
    tmp |= LPI2C_SCFGR1_ADDRCFG(configuration);
    baseAddr->SCFGR1 = tmp;
}


/*!
 * @brief Return the address match configuration
 * 
 * This function returns the currently configured option for address match.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  address match configuration
 */
static inline lpi2c_slave_addr_config_t LPI2C_HAL_SlaveGetAddrConfig(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SCFGR1;
    tmp = (tmp & LPI2C_SCFGR1_ADDRCFG_MASK) >> LPI2C_SCFGR1_ADDRCFG_SHIFT;
    return (lpi2c_slave_addr_config_t)tmp;
}


/*!
 * @brief Control detection of the High-speed Mode master code
 * 
 * This function enables or disables the detection of the High-speed Mode 
 * master code of slave address 0000_1XX, but does not cause an address match 
 * on this code. When set and any Hs-mode master code is detected, the slave 
 * filter and ACK stalls are disabled until the next STOP condition is detected.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable/disable the detection of the High-speed Mode master code
 */
static inline void LPI2C_HAL_SlaveSetHighSpeedModeDetect(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_HSMEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the state of the High-speed Mode master code detection
 * 
 * This function returns the currently configured option for master code detection.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  enabled/disabled state of the High-speed Mode master code detection
 */
static inline bool LPI2C_HAL_SlaveGetHighSpeedModeDetect(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_HSMEN_SHIFT);
}


/*!
 * @brief Control slave behaviour when NACK is detected
 * 
 * This function controls the option to ignore received NACKs. When enabled, the 
 * LPI2C slave will continue transfers after a NACK is detected. This option is needed
 * for Ultra-Fast mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param nack_config  slave behaviour when NACK is detected
 */
static inline void LPI2C_HAL_SlaveSetIgnoreNACK(LPI2C_Type *baseAddr, lpi2c_slave_nack_config_t nack_config)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_IGNACK_SHIFT) = (uint32_t)nack_config;
}


/*!
 * @brief Return the configured slave behaviour when NACK is detected
 * 
 * This function returns the currently configured option for handling NACKs.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  configured slave behaviour when NACK is detected
 */
static inline lpi2c_slave_nack_config_t LPI2C_HAL_SlaveGetIgnoreNACK(LPI2C_Type *baseAddr)
{
    return (lpi2c_slave_nack_config_t)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_IGNACK_SHIFT);
}


/*!
 * @brief Control the functionality of the receive data register
 * 
 * This function can configure the receive data register to allow the address to be
 * read from it. When this option is enabled reading the data register when an 
 * address valid event is active will return the address and clear the address valid 
 * event. When the address valid event is not active data reads will behave normally
 * (return received data and clear the receive data event).
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param configuration  controls if address can be read from the receive data register
 */
static inline void LPI2C_HAL_SlaveSetRxDataConfig(LPI2C_Type *baseAddr, lpi2c_slave_rxdata_config_t configuration)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_RXCFG_SHIFT) = (uint32_t)configuration;
}


/*!
 * @brief Return the configured functionality of the receive data register
 * 
 * This function returns the current configuration for the receive data register.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  specifies if address can be read from the receive data register
 */
static inline lpi2c_slave_rxdata_config_t LPI2C_HAL_SlaveGetRxDataConfig(LPI2C_Type *baseAddr)
{
    return (lpi2c_slave_rxdata_config_t)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_RXCFG_SHIFT);
}


/*!
 * @brief Control the conditions for setting the transmit data flag
 * 
 * This function controls the conditions that will trigger transmit data events. If this option is
 * enabled the transmit data register is automatically emptied when a slave-transmit transfer is
 * detected. This cause the transmit data event to be triggered whenever a slave-transmit transfer 
 * is detected and negate at the end of the slave-transmit transfer.
 * If this option is disabled the transmit data event will assert whenever the transit data register 
 * is empty and negate when the transmit data register is full. This allows the transmit data register
 * to be filled before a slave transmit transfer is detected, but can cause the transmit data register
 * to be written before a NACK is detected on the last byte of a slave transmit transfer.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param configuration  controls if transmit data flag is automatically cleared when NACK is detected
 */
static inline void LPI2C_HAL_SlaveSetTxFlagConfig(LPI2C_Type *baseAddr, lpi2c_slave_txflag_config_t configuration)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_TXCFG_SHIFT) = (uint32_t)configuration;
}


/*!
 * @brief Return the configured settings for the transmit data flag
 * 
 * This function returns the currently configured setting for the transmit data flag.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  specifies if transmit data flag is automatically cleared when NACK is detected
 */
static inline lpi2c_slave_txflag_config_t LPI2C_HAL_SlaveGetTxFlagConfig(LPI2C_Type *baseAddr)
{
    return (lpi2c_slave_txflag_config_t)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_TXCFG_SHIFT);
}


/*!
 * @brief Enable or disable match on SMBus Alert
 * 
 * This function enables or disables match on SMBus Alert.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable or disable match on SMBus Alert
 */
static inline void LPI2C_HAL_SlaveSetSMBusAlert(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_SAEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the configured state for the SMBus Alert match
 * 
 * This function returns the currently configured setting for SMBus Alert match.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  specifies if match on SMBus Alert is enabled or disabled
 */
static inline bool LPI2C_HAL_SlaveGetSMBusAlert(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_SAEN_SHIFT);
}


/*!
 * @brief Enable or disable general call address
 * 
 * This function enables or disables match general call address.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable or disable general call address
 */
static inline void LPI2C_HAL_SlaveSetGeneralCall(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_GCEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the configured state for the general call address
 * 
 * This function returns the currently configured setting for general call address matching.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  specifies if general call address is enabled or disabled
 */
static inline bool LPI2C_HAL_SlaveGetGeneralCall(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_GCEN_SHIFT);
}


/*!
 * @brief Enable or disable clock stretching for the sending of the ACK bit
 * 
 * This function enables or disables SCL clock stretching during slave-transmit address 
 * byte(s) and slave-receiver address and data byte(s) to allow software to write the 
 * Transmit ACK Register before the ACK or NACK is transmitted. Clock stretching occurs 
 * when transmitting the 9th bit and is therefore not compatible with high speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable or disable clock stretching
 */
static inline void LPI2C_HAL_SlaveSetACKStall(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_ACKSTALL_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the configured state for clock stretching for the sending of the ACK bit
 * 
 * This function returns the currently configured setting for clock stretching before 
 * the ACK bit.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indicates if clock stretching is enabled or disabled
 */
static inline bool LPI2C_HAL_SlaveGetACKStall(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_ACKSTALL_SHIFT);
}


/*!
 * @brief Enable or disable clock stretching for data transmission
 * 
 * This function enables or disables SCL clock stretching when the transmit data 
 * flag is set during a slave-transmit transfer. Clock stretching occurs following 
 * the 9th bit and is therefore compatible with high speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable or disable clock stretching
 */
static inline void LPI2C_HAL_SlaveSetTXDStall(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_TXDSTALL_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the configured state for clock stretching for data transmission
 * 
 * This function returns the currently configured setting for data transmission 
 * clock stretching.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indicates if clock stretching is enabled or disabled
 */
static inline bool LPI2C_HAL_SlaveGetTXDStall(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_TXDSTALL_SHIFT);
}


/*!
 * @brief Enable or disable clock stretching for data reception
 * 
 * This function enables or disables SCL clock stretching when receive data flag 
 * is set during a slave-receive transfer. Clock stretching occurs following the 9th
 * bit and is therefore compatible with high speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable or disable clock stretching
 */
static inline void LPI2C_HAL_SlaveSetRXStall(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_RXSTALL_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the configured state for clock stretching for data reception
 * 
 * This function returns the currently configured setting for data reception 
 * clock stretching.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indicates if clock stretching is enabled or disabled
 */
static inline bool LPI2C_HAL_SlaveGetRXStall(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_RXSTALL_SHIFT);
}


/*!
 * @brief Enable or disable clock stretching for valid address reception
 * 
 * This function enables or disables SCL clock stretching when the address valid 
 * flag is asserted. Clock stretching only occurs following the 9th bit and is 
 * therefore compatible with high speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param enable  enable or disable clock stretching
 */
static inline void LPI2C_HAL_SlaveSetAddrStall(LPI2C_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_ADRSTALL_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Return the configured state for clock stretching for valid address reception
 * 
 * This function returns the currently configured setting for address valid 
 * clock stretching.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  indicates if clock stretching is enabled or disabled
 */
static inline bool LPI2C_HAL_SlaveGetAddrStall(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SCFGR1), LPI2C_SCFGR1_ADRSTALL_SHIFT);
}


/*!
 * @brief Configure the LPI2C slave SDA glitch filter
 * 
 * This function configures the I2C slave digital glitch filters for SDA input. 
 * A configuration of 0 will disable the glitch filter. Glitches equal to or less 
 * than FILTSDA cycles long will be filtered out and ignored. The latency through 
 * the glitch filter is equal to FILTSDA+3 cycles and must be configured less than 
 * the minimum SCL low or high period. The glitch filter cycle count is not affected 
 * by the PRESCALE configuration, and is disabled in high speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the LPI2C slave SDA glitch filter
 */
static inline void LPI2C_HAL_SlaveSetSDAGlitchFilter(LPI2C_Type *baseAddr, uint8_t cycles)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp &= ~(LPI2C_SCFGR2_FILTSDA_MASK);
    tmp |= LPI2C_SCFGR2_FILTSDA(cycles);
    baseAddr->SCFGR2 = tmp;
}


/*!
 * @brief Return the LPI2C slave SDA glitch filter configuration
 * 
 * This function returns the currently configured slave SDA glitch filter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the LPI2C slave SDA glitch filter
 */
static inline uint8_t LPI2C_HAL_SlaveGetSDAGlitchFilter(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp = (tmp & LPI2C_SCFGR2_FILTSDA_MASK) >> LPI2C_SCFGR2_FILTSDA_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Configure the LPI2C slave SCL glitch filter
 * 
 * This function configures the I2C slave digital glitch filters for SCL input, 
 * a configuration of 0 will disable the glitch filter. Glitches equal to or less 
 * than FILTSCL cycles long will be filtered out and ignored. The latency through 
 * the glitch filter is equal to FILTSCL+3 cycles and must be configured less than 
 * the minimum SCL low or high period. The glitch filter cycle count is not affected 
 * by the PRESCALE configuration, and is disabled in high speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the LPI2C slave SCL glitch filter
 */
static inline void LPI2C_HAL_SlaveSetSCLGlitchFilter(LPI2C_Type *baseAddr, uint8_t cycles)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp &= ~(LPI2C_SCFGR2_FILTSCL_MASK);
    tmp |= LPI2C_SCFGR2_FILTSCL(cycles);
    baseAddr->SCFGR2 = tmp;
}


/*!
 * @brief Return the LPI2C slave SCL glitch filter configuration
 * 
 * This function returns the currently configured slave SDA glitch filter.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the LPI2C slave SCL glitch filter
 */
static inline uint8_t LPI2C_HAL_SlaveGetSCLGlitchFilter(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp = (tmp & LPI2C_SCFGR2_FILTSCL_MASK) >> LPI2C_SCFGR2_FILTSCL_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Configure the SDA data valid delay time for the I2C slave
 * 
 * This function configures the SDA data valid delay time for the I2C slave 
 * equal to FILTSCL+DATAVD+3 cycles. This data valid delay must be configured 
 * to less than the minimum SCL low period. The I2C slave data valid delay time 
 * is not affected by the PRESCALE configuration, and is disabled in high speed 
 * mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the SDA data valid delay time for the I2C slave
 */
static inline void LPI2C_HAL_SlaveSetDataValidDelay(LPI2C_Type *baseAddr, uint8_t cycles)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp &= ~(LPI2C_SCFGR2_DATAVD_MASK);
    tmp |= LPI2C_SCFGR2_DATAVD(cycles);
    baseAddr->SCFGR2 = tmp;
}


/*!
 * @brief Return the SDA data valid delay time configuration
 * 
 * This function returns the currently configured slave data valid delay.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the SDA data valid delay time for the I2C slave
 */
static inline uint8_t LPI2C_HAL_SlaveGetDataValidDelay(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp = (tmp & LPI2C_SCFGR2_DATAVD_MASK) >> LPI2C_SCFGR2_DATAVD_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Configure the minimum clock hold time for the I2C slave
 * 
 * This function configures the minimum clock hold time for the I2C slave, when 
 * clock stretching is enabled. The minimum hold time is equal to CLKHOLD+3 cycles. 
 * The I2C slave clock hold time is not affected by the PRESCALE configuration, 
 * and is disabled in high speed mode.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param cycles  number of cycles for the minimum clock hold time for the I2C slave
 */
static inline void LPI2C_HAL_SlaveSetClockHoldTime(LPI2C_Type *baseAddr, uint8_t cycles)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp &= ~(LPI2C_SCFGR2_CLKHOLD_MASK);
    tmp |= LPI2C_SCFGR2_CLKHOLD(cycles);
    baseAddr->SCFGR2 = tmp;
}


/*!
 * @brief Return the minimum clock hold time configuration
 * 
 * This function returns the currently configured slave clock hold time.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  number of cycles for the minimum clock hold time for the I2C slave
 */
static inline uint8_t LPI2C_HAL_SlaveGetClockHoldTime(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SCFGR2;
    tmp = (tmp & LPI2C_SCFGR2_CLKHOLD_MASK) >> LPI2C_SCFGR2_CLKHOLD_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Configure the ADDR1 address for slave address match
 * 
 * This function configures the ADDR1 value which is used to validate the received 
 * slave address. In 10-bit mode, the first address byte is compared to 
 * { 11110, ADDR1[10:9] } and the second address byte is compared to ADDR1[8:1]. 
 * In 7-bit mode, the address is compared to ADDR1[7:1]
 * The formula used for address validation is configured with function 
 * LPI2C_HAL_SlaveSetAddrConfig().
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param addr  ADDR1 address for slave address match
 */
static inline void LPI2C_HAL_SlaveSetAddr1(LPI2C_Type *baseAddr, uint16_t addr)
{
    uint32_t tmp = baseAddr->SAMR;
    tmp &= ~(LPI2C_SAMR_ADDR1_MASK);
    tmp |= LPI2C_SAMR_ADDR1(addr);
    baseAddr->SAMR = tmp;
}


/*!
 * @brief Return the ADDR1 address for slave address match
 * 
 * This function returns the currently configured value for ADDR1.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  ADDR1 address for slave address match
 */
static inline uint16_t LPI2C_HAL_SlaveGetAddr1(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SAMR;
    tmp = (tmp & LPI2C_SAMR_ADDR1_MASK) >> LPI2C_SAMR_ADDR1_SHIFT;
    return (uint16_t)tmp;
}


