arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpi2c_hal.h
/*!
 * @brief Configure the ADDR0 address for slave address match
 * 
 * This function configures the ADDR0 value which is used to validate the received 
 * slave address. In 10-bit mode, the first address byte is compared to 
 * { 11110, ADDR0[10:9] } and the second address byte is compared to ADDR0[8:1]. 
 * In 7-bit mode, the address is compared to ADDR0[7:1]
 * The formula used for address validation is configured with function 
 * LPI2C_HAL_SlaveSetAddrConfig().
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param addr  ADDR0 address for slave address match
 */
static inline void LPI2C_HAL_SlaveSetAddr0(LPI2C_Type *baseAddr, uint16_t addr)
{
    uint32_t tmp = baseAddr->SAMR;
    tmp &= ~(LPI2C_SAMR_ADDR0_MASK);
    tmp |= LPI2C_SAMR_ADDR0(addr);
    baseAddr->SAMR = tmp;
}


/*!
 * @brief Return the ADDR0 address for slave address match
 * 
 * This function returns the currently configured value for ADDR0.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  ADDR0 address for slave address match
 */
static inline uint16_t LPI2C_HAL_SlaveGetAddr0(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SAMR;
    tmp = (tmp & LPI2C_SAMR_ADDR0_MASK) >> LPI2C_SAMR_ADDR0_SHIFT;
    return (uint16_t)tmp;
}


/*!
 * @brief Check the validity of received address
 * 
 * This function checks whether the received address register contains a 
 * valid address.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  validity of received address
 */
static inline lpi2c_slave_addr_valid_t LPI2C_HAL_SlaveGetAddrValid(LPI2C_Type *baseAddr)
{
    return (lpi2c_slave_addr_valid_t)BITBAND_ACCESS32(&(baseAddr->SASR), LPI2C_SASR_ANV_SHIFT);
}


/*!
 * @brief Return the received slave address
 * 
 * This function returns the received slave address. Reading the address clears 
 * the address valid event. The address can be 7-bit or 10-bit (10-bit addresses 
 * are prefixed by 11110) and includes the R/W bit in the least significant position.
 * Use function LPI2C_HAL_SlaveGetAddrValid() before calling this function to 
 * ensure a valid value will be read.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  received address
 */
static inline uint16_t LPI2C_HAL_SlaveGetReceivedAddr(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SASR;
    tmp = (tmp & LPI2C_SASR_RADDR_MASK) >> LPI2C_SASR_RADDR_SHIFT;
    return (uint16_t)tmp;
}


/*!
 * @brief Configure the ACK/NACK transmission after a received byte
 * 
 * This function can be used to instruct the LPI2C slave whether to send an ACK or 
 * a NACK after receiving a byte. When ACK stall is enabled this function must be 
 * called after each matching address and after each received data byte. It can also 
 * be called when LPI2C Slave is disabled or idle to configure the default ACK/NACK.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param nack  specifies whether to transmit ACK or NACK
 */
static inline void LPI2C_HAL_SlaveSetTransmitNACK(LPI2C_Type *baseAddr, lpi2c_slave_nack_transmit_t nack)
{
    BITBAND_ACCESS32(&(baseAddr->STAR), LPI2C_STAR_TXNACK_SHIFT) = (uint32_t)nack;
}


/*!
 * @brief Return the configured ACK/NACK transmission setting
 * 
 * This function returns the currently configured setting for ACK/NACK response.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  specifies whether ACK or NACK is configured to be transmitted
 */
static inline lpi2c_slave_nack_transmit_t LPI2C_HAL_SlaveGetTransmitNACK(LPI2C_Type *baseAddr)
{
    return (lpi2c_slave_nack_transmit_t)BITBAND_ACCESS32(&(baseAddr->STAR), LPI2C_STAR_TXNACK_SHIFT);
}


/*!
 * @brief Provide data for the LPI2C slave transmitter
 * 
 * This function provides one byte of data for the LPI2C slave to transmit. 
 * Calling this function clears the transmit data event.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @param data  data for the LPI2C slave transmitter
 */
static inline void LPI2C_HAL_SlaveTransmitData(LPI2C_Type *baseAddr, uint8_t data)
{
    baseAddr->STDR = (uint32_t)data;
}


/*!
 * @brief Check if the current received data is the first in the current frame
 * 
 * This function checks if the currently received data byte is the first byte 
 * since a (repeated) START or STOP condition.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  specifies if the current received data is the first in the current frame
 */
static inline bool LPI2C_HAL_SlaveGetStartOfFrame(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SRDR), LPI2C_SRDR_SOF_SHIFT);
}


/*!
 * @brief Check if the receive data register is empty
 * 
 * This function checks if the received data register is empty.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  specifies if the receive data register is empty
 */
static inline bool LPI2C_HAL_SlaveGetRXEmpty(LPI2C_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SRDR), LPI2C_SRDR_RXEMPTY_SHIFT);
}


/*!
 * @brief Return the data received by the LPI2C slave receiver
 * 
 * This function returns the data received by the I2C slave.
 * Calling this function clears the receive data event.
 * 
 * @param baseAddr  base address of the LPI2C module
 * @return  data received by the LPI2C slave receiver
 */
static inline uint8_t LPI2C_HAL_SlaveGetData(LPI2C_Type *baseAddr)
{
    uint32_t tmp = baseAddr->SRDR;
    tmp = (tmp & LPI2C_SRDR_DATA_MASK) >> LPI2C_SRDR_DATA_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Initializes the LPI2C module to a known state.
 *
 * This function initializes all the registers of the LPI2C module to 
 * their reset value.
 *
 * @param baseAddr  base address of the LPI2C module
 */
void LPI2C_HAL_Init(LPI2C_Type *baseAddr);

/*! @}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_LPI2C_HAL_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/

